print('''
Создайте список своих любимых развлечений и сохраните его в переменной games. 
Теперь создайте список любимых лакомств, сохранив его  в переменной foods. 
Объедините два этих списка, сохранив результат в переменной favorites, 
и напечатайте значение этой переменной.
''')
games = ['basketball', 'football', 'tenis', 'rugby']
foods = ['hotdog', 'zepelin', 'potato fries']
favorites = games + foods
print(favorites)
